[
{"title": "Our Brains Are Not Multi-Threaded", "date": "September 10th, 2019 · ", "text": ["In computer programming, it’s common to split your program into multiple different ", " that run simultaneously, as this often simplifies application design. ", "Imagine, for example, you’re creating a basic game. You might have one thread dedicated to updating the graphics on the screen, another thread dedicated to calculating the next move, and another monitoring the mouse to see if the user is trying to click. ", "You could, of course, write a single-threaded program that explicitly switches back and forth between working on these different tasks, but it’s often much easier for the programmer to write independent threads, each dedicated to its own part of the larger system.", "In a world before multi-core processors, these threads weren’t actually running simultaneously, as the underlying processor could only execute one instruction at a time. What it did instead was switch rapidly between the threads, executing a few instructions from one, before moving on to the next, then the next, and then back to the first, and so on — providing a staccato-paced pseudo-simultaneity that was close enough to true parallel processing to serve the desired purpose.", "Something I’ve noticed is that many modern knowledge workers approach their work like a multi-threaded computer program. They’ve agreed to many, many different projects, investigations, queries and small tasks, and attempt, each day, to keep advancing them all in parallel by turning their attention rapidly from one to another — replying to an email here, dashing off a quick message there, and so on — like a CPU dividing its cycles between different pieces of code.", "The problem with this analogy is that the human brain is not a computer processor. A silicon chip etched with microscopic circuits switches cleanly from instruction to instruction, agnostic to the greater context from which the current instruction arrived: op codes are executed; electrons flow; the circuit clears; the next op code is loaded.", "The human brain is messier. ", "When you switch your brain to a new “thread,” a whole complicated mess of neural activity begins to activate the proper sub-networks and suppress others. This takes time. When you then rapidly switch to another “thread,” that work doesn’t clear instantaneously like electrons emptying from a circuit, but instead lingers, causing conflict with the new task.", "To make matters worse, the idle “threads” don’t sit passively in memory, waiting quietly to be summoned by your neural processor, they’re instead an active presence, generating middle-of-the-night anxiety, and pulling at your attention. To paraphrase David Allen, the more commitments lurking in your mind, the more psychic toll they exert.", "This is all to say that the closer I look at the evidence regarding how our brains function, the more I’m convinced that we’re designed to be single-threaded, working on things one at a time, waiting to reach a natural stopping point before moving on to what’s next.  ", "So why do we tolerate all the negative side-effects generated from trying to force our neurons to poorly simulate parallel programs? Because it’s easier, in the moment, than trying to develop  professional workflows that better respect our brains’ fundamental nature.", "This explanation is understandable. But to a computer scientist trained in optimality, it also seems far from acceptable."]},
{"title": "On the Surprising Benefits of an Un-Mobile Phone", "date": "September 3rd, 2019 · ", "text": ["A college senior I’ll call Brady recently sent me a description of his creative experiments with ", ". What caught my attention about his story was that his changes centered on a radical idea: ", ".", "In more detail, Brady leaves behind his phone each day when he heads off to campus to take classes and study, allowing him to complete his academic work without distraction. As Brady reports, on returning home, usually around 6:00 pm, “I [will spend] 20 minutes or so responding to emails, texts, and the like.” ", "Then comes the important part of his plan: after this check, he leaves his phone plugged into the outlet  — rendering it literally tethered to the wall.", "His goal was to reclaim the evening leisure hours he used to lose to “mindlessly browsing the internet.” Here’s Brady’s description of his life before he detached himself from his phone:", "Like many new ", ", after Brady got more intentional about his technology, he was confronted with a sudden influx of free time. Fortunately, having read ", ", he was prepared for this change, and responded by aggressively filling in these newly open hours with carefully-selected activity.", "Here’s his summary:"]},
{"title": "Is Our Fear of Smartphones Overblown?", "date": "August 23rd, 2019 · ", "text": ["During interviews for ", ", I’m frequently asked whether I think our culture’s concerns about new technologies like smartphones and social media represent a fleeting moral panic. ", "The argument goes something like this: There are many technologies that were once feared but that we now consider to be relatively tame, from rock music, to the radio, to the telegraph famously lamented by Thoreau. Isn’t our concern about today’s tech just more of the same?", "This is a genuinely interesting question that’s worth some careful unpacking. My main issue with this approach to the issues surrounding smartphones and social media is that it implicitly builds on the following logical formulation: "]},
{"title": "“I Was Lacking in Enough Energy, Time and Attention”: Another Digital Minimalism Case Study", "date": "August 17th, 2019 · ", "text": ["Something I’ve learned reporting on ", " is that the definition of “minimal” differs greatly from person to person. As part of my effort to share more case studies about this philosophy, I thought it might be fun to visit someone who falls on the extreme end of this spectrum.", "Robert (as I’ll call him) recently walked me through some of the major changes  he instigated to reclaim his life from his devices. He summarized his reasons for this transformation as follows:", "Driven by these somber realities, he came to a simple revelation: “life would be better if I cut back.” A decision, as it turns out, he took seriously."]},
{"title": "On the Art of Learning Things (Ultra) Quickly", "date": "August 8th, 2019 · ", "text": ["In the first chapter of ", ", I argue that the ability to concentrate is important in part because it’s necessary to learn hard things quickly, and in our economy, if you can pick up new skills or ideas fast, you have a massive competitive advantage.", "Some readers subsequently asked me ", " to best deploy their concentration to achieve these feats of accelerated autodidacticism. My answer has been to direct people toward my longtime friend, and occasional collaborator, Scott Young, who has spent years mastering the art of mastering things (c.f., ", ".)", "I’m happy to report that as of earlier this week, instead of simply waving vaguely in Scott’s general direction, I can now point to a brand new book that he’s published on the topic: ", "In this book, Scott walks through his step-by-step process of breaking down a major learning project and pushing it through to completion much faster than you might have imagined possible. It’s important to emphasize that he provides no short cuts. If anything, he highlights the surprising hardness — in terms of concentration and drive — required to succeed with these endeavors; a point I’ve been underscoring since ", ".", "But if you’re willing to invest the energy, and are looking for the right techniques to make sure this energy is not wasted to the friction of ineffective activity, this is the book for you."]},
{"title": "“It’s Like I Couldn’t Stop”: A Digital Minimalism Case Study", "date": "August 4th, 2019 · ", "text": ["It’s hard to believe that it has already been six months since ", " was released. (If you’re interested in browsing some of the interviews and press about the book, I’ve been doing my best to update ", " with some highlights.)", "One of the nice things about having had some time pass since publication is that I’m starting to receive case studies from readers who have been experimenting with ideas from the book long enough to report results. I thought it might be useful to occasionally share some of these stories, especially for those who are still deciding whether or not to take the plunge with this philosophy."]},
{"title": "The Dynamite Circle: A Long Tail Social Media Case Study", "date": "July 23rd, 2019 · ", "text": [" has been on the periphery of my radar since my early days as a blogger. It’s a small, subscription-based social network operated by the ", " web site, which caters to entrepreneurs running small businesses from exotic locations (I’ve been a guest on their podcast a ", " ", "). ", "This network, abbreviated simply as DC,  has around 1200 enthusiastic members.  In theory, these individuals could have found each other and organized on existing major social media platforms, using custom hash tags and Facebook Groups, or perhaps gathering on a sub-reddit, or subscribing to each others’ Instagram feeds. ", "All of this would be free and supported by slick apps with polished interfaces.", "Instead, DC members pay around $500 a year to access a custom set of private forums: there are no sophisticated image recognition algorithms auto-tagging photos, or machine learning models carefully selecting posts to maximize engagement. And no one seems to care.", "To help understand what’s going on here, I asked co-founder Dan Andrews if he’d allow me to lurk around the DC network for an afternoon. He graciously agreed. What I discovered gets to the core of the long form social media phenomenon I’ve been writing about recently (c.f., ", ", ", ")."]},
{"title": "Blurring Offline and Online: More on the Potential of Long Tail Social Media", "date": "July 17th, 2019 · ", "text": ["Earlier this week, ", ". The premise behind this trend is that as our internet habits mature, we no longer need social platforms with massive user bases. ", "I’m cautiously optimistic about this model as I think niche networks can better deliver on the promise of the social internet while avoiding pitfalls like engineered addiction and emotional manipulation. (These smaller alternatives also tend to be better on the ", " like data privacy and effective contention moderation.)", "In response to ", " on this topic, a reader pointed me toward a fascinating long tail social media case study that I wanted to briefly share, as I think it helps underscore the potential of this movement."]}
]